In [6]:
import pandas as pd
import sys
sys.path.append("..")
from src.database import execute_query, Facture, Achat, Produit, Client, Log, engine
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, Column, String, Date, Numeric, DateTime, ForeignKey, func
from sqlalchemy.orm import declarative_base, sessionmaker
from dotenv import load_dotenv
import os
import pandas as pd
from sqlalchemy import text
SessionLocal = sessionmaker(autocommit=False, autoflush=False, bind=engine)

# Explorations des données

In [14]:
execute_query("SELECT COUNT(*) FROM melody.client")

   count
0    927

In [15]:
execute_query("SELECT COUNT(*) FROM melody.achat")

   count
0   2004

In [16]:
execute_query("SELECT COUNT(*) FROM melody.facture")

   count
0   5096

In [17]:
execute_query("SELECT COUNT(*) FROM melody.produit")

   count
0   2004

In [22]:
execute_query("SELECT * FROM melody.produit")

,id_produit,nom,prix
0,PROD_edge_so_crime,edge so crime share.,12.18
1,PROD_thank_do_article,thank do article especially.,67.86
2,PROD_include_dinner_main,include dinner main friend.,287.99
3,PROD_capital_hear_morning,capital hear morning people.,55.43
4,PROD_between_everybody_size,between everybody size conference.,45.70
...,...,...,...
1999,PROD_ltem_put_suffer,ltem put suffer none.,139.96
2000,PROD_yourself_network_product,yourself network product sister.,43.08
2001,PROD_chair_after_standard,chair after standard see.,4.23
2002,PROD_other_season_whose,other season whose who.,58.50
2003,PROD_maitter_certainly_factor,maitter certainly factor also.,0.10

In [21]:
execute_query("SELECT * FROM melody.client")

,id_client,nom,mail,adresse,birthdate,genre
0,CLT_Carol_Potter,Carol Potter,ashley38@example.org,"405 Adrian Crest Suite 095 Jamesstad, MM 36094",2000-02-16,F
1,CLT_Samuel_Coleman,Samuel Coleman,qmeyer@example.com,"64623 Wright Mills Turnermouth, K5 45555",1999-11-03,F
2,CLT_Richard_Dunn,Richard Dunn,phughes@exampie.com,3305 Maureen Manors West Daniel NY 27137,1989-04-24,M
3,CLT_Mario_Stout,Mario Stout,danielledaniels@example.org,"48010 Margaret Passage Suite 093 Walshshire, I...",1999-03-26,F
4,CLT_Rachel_Ramirez,Rachel Ramirez,patriciakelley@exampile.org,"7896 Jones Underpass Kennethborough, CT 89365",1989-05-20,M
...,...,...,...,...,...,...
922,CLT_Vanessa_Johnston,Vanessa Johnston,thomas10@example.com,"7282 Gordon Shores Apt. 799 Humphreytawn, TN 4...",1999-07-07,F
923,CLT_Monique_Williams,Monique Williams,ericcarpenter@example.com,Unit 8792 Box 5104 DPO AA 20809,1989-11-07,F
924,CLT_Bradley_Ramsey,Bradley Ramsey,kimberly32@example.org,"PSC 3042, Box 2314 APO AA 35572",1989-11-17,M
925,CLT_Megan_Blanchard,Megan Blanchard,janetpena@example.net,"847 Doris Manors West Marissamouth, OK 20416",1989-10-22,F
926,CLT_Briana_Ortiz,Briana Ortiz,deannajohnson@example.com,"96831 Ford Brook Apt. 303 Port Robinstad, KY ...",1989-05-15,M

In [23]:
execute_query("SELECT * FROM melody.facture")

,id_facture,texte,date_facturation,total
0,2018-0001,Edge so crime share.\n\nThank do article espec...,2018-10-13 03:27:00,1146.84
1,2018-0002,Between everybody size conference.\nTOTAL 4 x ...,2018-10-17 13:37:00,182.8
2,2018-0003,Item model true sell.\n\nGuess want sound site...,2018-11-03 23:58:00,152.98
3,2018-0004,War commercial dream even.\nThing speech fire ...,2018-11-14 18:10:00,292.16
4,2018-0005,Visit money record ability.\nTOTAL 1 x 74.84 E...,2018-11-17 18:13:00,74.84
...,...,...,...,...
5091,2024-0839,Level fall son PM.\nTOTAL 2x 63.34 Euro\n126.6...,2024-12-29 22:15:00,126.68
5092,2024-0840,Bring which air short.\n\nPainting admit how m...,2024-12-30 11:06:00,193.78
5093,2024-0841,Foot develop with since.\nTOTAL 4 x 27.27 Euro...,2024-12-31 11:57:00,109.08
5094,2024-0842,Up something clearly everybody.\nCentury quali...,2024-12-31 16:01:00,1104.84
5095,2024-0843,Air million able memory.\nTOTAL 1 x 333.65 Eur...,2024-12-31 17:42:00,333.65

In [24]:
execute_query("SELECT * FROM melody.achat")

                         id_produit            id_client id_facture quantité
0                PROD_edge_so_crime     CLT_Carol_Potter  2018-0001     4.00
1             PROD_thank_do_article     CLT_Carol_Potter  2018-0001     1.00
2          PROD_include_dinner_main     CLT_Carol_Potter  2018-0001     3.00
3         PROD_capital_hear_morning     CLT_Carol_Potter  2018-0001     3.00
4       PROD_between_everybody_size   CLT_Samuel_Coleman  2018-0002     4.00
...                             ...                  ...        ...      ...
1999           PROD_ltem_put_suffer     CLT_Mark_Miranda  2023-0296     2.00
2000  PROD_yourself_network_product  CLT_Joshua_Robinson  2023-0462     3.00
2001      PROD_chair_after_standard     CLT_David_Hughes  2023-0577     2.00
2002        PROD_other_season_whose        CLT_Ray_Knapp  2024-0295     1.00
2003  PROD_maitter_certainly_factor     CLT_Chad_Hubbard  2024-0391     3.00

[2004 rows x 4 columns]

# Récupération des données pour la segmentation rfm

## Récupération montant

In [ ]:
execute_query("""select a.id_client, sum(f.total)
from melody.facture f 
join melody.achat a 
on f.id_facture = a.id_facture 
join melody.client c 
on a.id_client = c.id_client 
group by f.id_facture , a.id_client ;""")

                 id_client      sum
0         CLT_James_Nguyen   960.10
1          CLT_Jacob_Smith  2496.06
2      CLT_Mrs._Erin_Ramos   318.55
3         CLT_Thomas_Chung   6906.0
4            CLT_Amy_Velez    512.2
...                    ...      ...
1178  CLT_Elizabeth_Hooper   562.28
1179     CLT_Michael_Jones  1184.68
1180     CLT_Marcus_Taylor   688.06
1181    CLT_David_Gonzalez  6452.73
1182     CLT_Matthew_Young   331.23

[1183 rows x 2 columns]

In [ ]:
with SessionLocal() as session:
    query = (
        session.query(
            Client.id_client,
            func.sum(Facture.total).label('total_depense')
        )
        .join(Achat, Achat.id_facture == Facture.id_facture)
        .join(Client, Client.id_client == Achat.id_client)
        .group_by(Facture.id_facture, Client.id_client)
    )
    result = query.all()
    df = pd.DataFrame(result, columns=['id_client', 'total_depense'])
df

                 id_client total_depense
0         CLT_James_Nguyen        960.10
1          CLT_Jacob_Smith       2496.06
2      CLT_Mrs._Erin_Ramos        318.55
3         CLT_Thomas_Chung        6906.0
4            CLT_Amy_Velez         512.2
...                    ...           ...
1178  CLT_Elizabeth_Hooper        562.28
1179     CLT_Michael_Jones       1184.68
1180     CLT_Marcus_Taylor        688.06
1181    CLT_David_Gonzalez       6452.73
1182     CLT_Matthew_Young        331.23

[1183 rows x 2 columns]

## Récupération fréquence

In [27]:
execute_query("""select c.id_client, count(distinct a.id_facture)
from melody.achat a 
join melody.client c 
on a.id_client = c.id_client 
group by c.id_client;""")

                id_client  count
0        CLT_Adam_Burgess      2
1          CLT_Adam_Evans      1
2        CLT_Adam_Walters      1
3          CLT_Alan_Stone      2
4         CLT_Alan_Turner      3
..                    ...    ...
606  CLT_William_Mcdaniel      3
607    CLT_William_Medina      2
608    CLT_William_Ramsey      1
609     CLT_Yesenia_Huber      1
610     CLT_Zoe_Lynch_PhD      2

[611 rows x 2 columns]

In [ ]:
with SessionLocal() as session:
    query = (
        session.query(
            Client.id_client,
            func.count(Achat.id_facture.distinct())
        )
        .join(Client, Client.id_client == Achat.id_client)
        .group_by(Client.id_client)
    )
    result = query.all()
    df = pd.DataFrame(result, columns=['id_client', 'nombre de commande'])
df

                id_client  nombre de commande
0        CLT_Adam_Burgess                   2
1          CLT_Adam_Evans                   1
2        CLT_Adam_Walters                   1
3          CLT_Alan_Stone                   2
4         CLT_Alan_Turner                   3
..                    ...                 ...
606  CLT_William_Mcdaniel                   3
607    CLT_William_Medina                   2
608    CLT_William_Ramsey                   1
609     CLT_Yesenia_Huber                   1
610     CLT_Zoe_Lynch_PhD                   2

[611 rows x 2 columns]

## Récupération récence

In [28]:
execute_query("""select a.id_client, max(f.date_facturation) as mdate
from melody.achat a
join melody.facture f 
on f.id_facture = a.id_facture
join melody.client c
on c.id_client = a.id_client 
group by a.id_client;""")

                 id_client               mdate
0     CLT_Christina_Cortez 2021-10-24 11:30:00
1         CLT_Corey_Kelley 2020-07-10 23:49:00
2       CLT_Robert_Wallace 2019-06-20 03:40:00
3         CLT_Alicia_Jones 2021-08-12 03:07:00
4     CLT_Michelle_Carroll 2019-11-20 00:47:00
..                     ...                 ...
606   CLT_David_Oneill_PhD 2019-04-09 02:27:00
607      CLT_Michael_Estes 2019-05-11 23:55:00
608      CLT_Melanie_Greer 2020-01-07 03:41:00
609       CLT_Mary_Cabrera 2021-08-08 04:53:00
610  CLT_Catherine_Freeman 2022-02-05 03:35:00

[611 rows x 2 columns]

In [11]:
with SessionLocal() as session:
    query = (
        session.query(
            Achat.id_client,
            func.max(Facture.date_facturation).label("mdate")
        )
        .join(Facture, Facture.id_facture == Achat.id_facture)
        .join(Client, Client.id_client == Achat.id_client)
        .group_by(Achat.id_client)
    )
    result = query.all()
    df = pd.DataFrame(result, columns=['id_client', 'dernière commande'])
df

                 id_client   dernière commande
0     CLT_Christina_Cortez 2021-10-24 11:30:00
1         CLT_Corey_Kelley 2020-07-10 23:49:00
2       CLT_Robert_Wallace 2019-06-20 03:40:00
3         CLT_Alicia_Jones 2021-08-12 03:07:00
4     CLT_Michelle_Carroll 2019-11-20 00:47:00
..                     ...                 ...
606   CLT_David_Oneill_PhD 2019-04-09 02:27:00
607      CLT_Michael_Estes 2019-05-11 23:55:00
608      CLT_Melanie_Greer 2020-01-07 03:41:00
609       CLT_Mary_Cabrera 2021-08-08 04:53:00
610  CLT_Catherine_Freeman 2022-02-05 03:35:00

[611 rows x 2 columns]